Q-planning次数为：0
DynaQ 算法 n-planning = 0 最终收敛得到的策略为 
ooo> ooo> oo<o ooo> oo<o ooo> oo<o ooo> ovoo ovoo oo<o ovoo 
^ooo ooo> ooo> ooo> ooo> ooo> ^ooo ^ooo ooo> ooo> ooo> ovoo 
ooo> ooo> ooo> ooo> ooo> ooo> ooo> ooo> ooo> ooo> ooo> ov<o 
^ooo **** **** **** **** **** **** **** **** **** **** EEEE 
Q-planning次数为：2
DynaQ 算法 n-planning = 2 最终收敛得到的策略为 
ooo> ooo> ooo> ooo> ooo> ooo> ooo> ooo> ooo> ooo> ovoo ovoo 
ooo> ooo> ooo> ooo> ooo> ooo> ooo> ooo> ooo> ooo> ovoo ovoo 
ooo> ooo> ooo> ooo> ooo> ooo> ooo> ooo> ooo> ooo> ooo> ovoo 
^ooo **** **** **** **** **** **** **** **** **** **** EEEE 
Q-planning次数为：20
DynaQ 算法 n-planning = 20 最终收敛得到的策略为 
ooo> ooo> ooo> ooo> ovo> ovo> ovo> ovo> ovo> ovo> ovo> ovoo 
ooo> ooo> ovo> ovo> ovo> ovo> ovo> ovo> ovo> ovo> ovo> ovoo 
ooo> ooo> ooo> ooo> ooo> ooo> ooo> ooo> ooo> ooo> ooo> ov<o 
^ooo **** **** **** **** **** **** **** **** **** **** EEEE 
